cask_args appdir: "/Applications"

# Taps
tap "1password/tap"
tap "homebrew/bundle"

# CLI Tools and Utilities
brew "python@3.11"
brew "python@3.12"
brew "python@3.13"
brew "gh"
brew "git"
brew "glances"
brew "midnight-commander"
brew "mpv"
brew "speedtest"
brew "telnet"
brew "thefuck"

# AI and Data Science
brew "ollama"

# Media and Graphics
brew "ffmpeg"
brew "imagemagick"
brew "yt-dlp"

# Cloud and DevOps
brew "docker"
brew "docker-completion"

# Development Tools
brew "pyenv"
brew "ruff"

# Security and Network
cask "1password-cli"
cask "tailscale"
cask "microsoft-remote-desktop"

# Development Tools
cask "github"
cask "visual-studio-code"
cask "warp"
cask "android-platform-tools"
cask "cyberduck"
cask "flutter"
cask "mist"
cask "google-cloud-sdk"
cask "cursor"

# Productivity and Organization
cask "raycast"
cask "notion"
cask "notion-calendar"
cask "cron"
cask "google-drive"
cask "dropbox"
cask "cleanshot"
cask "bartender"
cask "istat-menus"
cask "permute"

# Communication and Media
cask "discord"
cask "spotify"
cask "beeper"
cask "screen-studio"
cask "wave"
cask "elgato-wave-link"

# Browsers
cask "arc"

# Hardware and Peripherals
cask "logi-options-plus"
cask "yubico-yubikey-manager"
