cask_args appdir: "/Applications"

#Tappers
tap "1password/tap"
tap "homebrew/bundle"

#Some dependancy and brew-related things that come in handy
brew "python@3.11"
brew "mas"
brew "mackup"
brew "gh"
brew "git"
brew "glances"
brew "midnight-commander"
brew "mpv"
brew "rclone"
brew "speedtest-cli"
brew "telnet"

#Good default applications to start doing things
cask "github"
cask "raycast"
cask "1password-cli"
cask "android-platform-tools"
cask "discord"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "arc"
cask "screen-studio"
cask "google-drive"
cask "microsoft-remote-desktop"
cask "cleanshot"
cask "beeper"
cask "bartender"
cask "istat-menus"
cask "tailscale"
cask "cyberduck"
cask "cron"
cask "notion"
cask "elgato-stream-deck"
cask "elgato-wave-link"

#Mac App Store apps to install
mas "Infuse", id: 1136220934

# VSCode Extensions
vscode "GitHub.vscode-pull-request-github"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redhat.vscode-xml"
